Ran Plan for dir: `terraform/kubernetes` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_record.kube_cp[1] will be destroyed
  # (because index [1] is out of range for count)
- resource "cloudflare_record" "kube_cp" {
      - allow_overwrite = false -> null
      - created_on      = "2023-11-11T13:42:42.24652Z" -> null
      - hostname        = "cp.home.bryanwp.com" -> null
      - id              = "ca5a86588716dbc815b6ccb0eaf13e69" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on     = "2023-11-11T13:42:42.24652Z" -> null
      - name            = "cp.home.bryanwp.com" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "A" -> null
      - value           = "192.168.2.111" -> null
      - zone_id         = "d2287afe1d6fbddb1a27e1a5b85b0288" -> null
    }

  # cloudflare_record.kube_cp[2] will be destroyed
  # (because index [2] is out of range for count)
- resource "cloudflare_record" "kube_cp" {
      - allow_overwrite = false -> null
      - created_on      = "2023-11-11T13:42:42.13004Z" -> null
      - hostname        = "cp.home.bryanwp.com" -> null
      - id              = "d66c9cf23d45d32ef07d6d70d9c5888e" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on     = "2023-11-11T13:42:42.13004Z" -> null
      - name            = "cp.home.bryanwp.com" -> null
      - proxiable       = false -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "A" -> null
      - value           = "192.168.2.112" -> null
      - zone_id         = "d2287afe1d6fbddb1a27e1a5b85b0288" -> null
    }

  # proxmox_virtual_environment_file.cp_config will be created
+ resource "proxmox_virtual_environment_file" "cp_config" {
      + content_type           = "snippets"
      + datastore_id           = "backup-nas"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "prox2"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = <<-EOT
                #cloud-config
                write_files:
                runcmd:
                  - hostnamectl set-hostname $(cat /dev/urandom | tr -dc 'a-z0-9' | fold -w 8 | head -n 1)-cp-worker
                  - curl -sfL https://get.k3s.io | K3S_URL=https://cp.home.bryanwp.com:6443 K3S_TOKEN=mynodetoken sh -
            EOT
          + file_name = "k3s-cp.cloud-config.yaml"
          + resize    = 0
        }
    }

  # proxmox_virtual_environment_file.wk_config must be replaced
-/+ resource "proxmox_virtual_environment_file" "wk_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "k3s-worker.cloud-config.yaml" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "backup-nas:snippets/k3s-worker.cloud-config.yaml" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = <<-EOT # forces replacement
                #cloud-config
                write_files:
                runcmd:
                  - hostnamectl set-hostname $(cat /dev/urandom | tr -dc 'a-z0-9' | fold -w 8 | head -n 1)-cp-worker
              -   - curl -sfL https://get.k3s.io | K3S_URL=https://cp.home.bryanwp.com:6443 K3S_TOKEN=mynodetoken sh -
              +   - curl -sfL https://get.k3s.io | sh - server --cluster-init
              +   #  - curl -sfL https://get.k3s.io | K3S_URL=https://cp.home.bryanwp.com:6443 K3S_TOKEN=mynodetoken sh -
            EOT
            # (2 unchanged attributes hidden)
        }
    }

  # proxmox_virtual_environment_vm.kube_cp[0] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "kube_cp" {
      ~ id                      = "500" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      ~ mac_addresses           = [
          - "32:E9:98:68:8C:07",
        ] -> (known after apply)
        name                    = "cp-polaris-0"
      ~ network_interface_names = [] -> (known after apply)
      ~ tags                    = [
          - "cp",
          - "k8s",
            "terraform",
          + "k8s",
          + "cp",
        ]
        # (21 unchanged attributes hidden)

      ~ disk {
          ~ path_in_datastore = "vm-500-disk-0" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ initialization {
          - interface         = "ide2" -> null
          + user_data_file_id = (known after apply) # forces replacement
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          ~ mac_address = "32:E9:98:68:8C:07" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.kube_cp[1] will be destroyed
  # (because index [1] is out of range for count)
- resource "proxmox_virtual_environment_vm" "kube_cp" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - description             = "Managed by Terraform" -> null
      - id                      = "501" -> null
      - ipv4_addresses          = [] -> null
      - ipv6_addresses          = [] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "AA:63:A9:82:38:37",
        ] -> null
      - migrate                 = false -> null
      - name                    = "cp-polaris-1" -> null
      - network_interface_names = [] -> null
      - node_name               = "prox2" -> null
      - on_boot                 = true -> null
      - reboot                  = false -> null
      - scsi_hardware           = "virtio-scsi-pci" -> null
      - started                 = true -> null
      - tablet_device           = true -> null
      - tags                    = [
          - "cp",
          - "k8s",
          - "terraform",
        ] -> null
      - template                = false -> null
      - timeout_clone           = 1800 -> null
      - timeout_create          = 1800 -> null
      - timeout_migrate         = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 501 -> null

      - agent {
          - enabled = false -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - clone {
          - full      = true -> null
          - node_name = "prox2" -> null
          - retries   = 1 -> null
          - vm_id     = 1002 -> null
        }

      - disk {
          - cache             = "none" -> null
          - datastore_id      = "local-lvm" -> null
          - file_format       = "raw" -> null
          - interface         = "scsi0" -> null
          - iothread          = false -> null
          - path_in_datastore = "vm-501-disk-0" -> null
          - size              = 8 -> null
          - ssd               = false -> null
        }

      - initialization {
          - datastore_id = "local-lvm" -> null
          - interface    = "ide2" -> null

          - ip_config {
              - ipv4 {
                  - address = "192.168.2.111/32" -> null
                  - gateway = "192.168.2.1" -> null
                }
            }
        }

      - network_device {
          - bridge      = "vmbr0" -> null
          - enabled     = true -> null
          - firewall    = false -> null
          - mac_address = "AA:63:A9:82:38:37" -> null
          - model       = "virtio" -> null
          - mtu         = 0 -> null
          - queues      = 0 -> null
          - rate_limit  = 0 -> null
          - vlan_id     = 0 -> null
        }

      - operating_system {
          - type = "l26" -> null
        }

      - serial_device {
          - device = "socket" -> null
        }

      - startup {
          - down_delay = 60 -> null
          - order      = 3 -> null
          - up_delay   = 60 -> null
        }
    }

  # proxmox_virtual_environment_vm.kube_cp[2] will be destroyed
  # (because index [2] is out of range for count)
- resource "proxmox_virtual_environment_vm" "kube_cp" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - description             = "Managed by Terraform" -> null
      - id                      = "502" -> null
      - ipv4_addresses          = [] -> null
      - ipv6_addresses          = [] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "B2:5E:1C:1F:9B:6D",
        ] -> null
      - migrate                 = false -> null
      - name                    = "cp-polaris-2" -> null
      - network_interface_names = [] -> null
      - node_name               = "pve" -> null
      - on_boot                 = true -> null
      - reboot                  = false -> null
      - scsi_hardware           = "virtio-scsi-pci" -> null
      - started                 = true -> null
      - tablet_device           = true -> null
      - tags                    = [
          - "cp",
          - "k8s",
          - "terraform",
        ] -> null
      - template                = false -> null
      - timeout_clone           = 1800 -> null
      - timeout_create          = 1800 -> null
      - timeout_migrate         = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 502 -> null

      - agent {
          - enabled = false -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - clone {
          - full      = true -> null
          - node_name = "prox2" -> null
          - retries   = 1 -> null
          - vm_id     = 1002 -> null
        }

      - disk {
          - cache             = "none" -> null
          - datastore_id      = "local-lvm" -> null
          - file_format       = "raw" -> null
          - interface         = "scsi0" -> null
          - iothread          = false -> null
          - path_in_datastore = "vm-502-disk-0" -> null
          - size              = 8 -> null
          - ssd               = false -> null
        }

      - initialization {
          - datastore_id = "local-lvm" -> null
          - interface    = "ide2" -> null

          - ip_config {
              - ipv4 {
                  - address = "192.168.2.112/32" -> null
                  - gateway = "192.168.2.1" -> null
                }
            }
        }

      - network_device {
          - bridge      = "vmbr0" -> null
          - enabled     = true -> null
          - firewall    = false -> null
          - mac_address = "B2:5E:1C:1F:9B:6D" -> null
          - model       = "virtio" -> null
          - mtu         = 0 -> null
          - queues      = 0 -> null
          - rate_limit  = 0 -> null
          - vlan_id     = 0 -> null
        }

      - operating_system {
          - type = "l26" -> null
        }

      - serial_device {
          - device = "socket" -> null
        }

      - startup {
          - down_delay = 60 -> null
          - order      = 3 -> null
          - up_delay   = 60 -> null
        }
    }

  # proxmox_virtual_environment_vm.kube_wk[0] must be replaced
-/+ resource "proxmox_virtual_environment_vm" "kube_wk" {
      ~ id                      = "550" -> (known after apply)
      ~ ipv4_addresses          = [
          - [
              - "127.0.0.1",
            ],
          - [
              - "192.168.2.120",
            ],
        ] -> (known after apply)
      ~ ipv6_addresses          = [
          - [
              - "::1",
            ],
          - [
              - "fe80::e0e1:41ff:fece:1c11",
            ],
        ] -> (known after apply)
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
          - "E2:E1:41:CE:1C:11",
        ] -> (known after apply)
        name                    = "wk-polaris-0"
      ~ network_interface_names = [
          - "lo",
          - "eth0",
        ] -> (known after apply)
      ~ tags                    = [
          - "k8s",
            "terraform",
          + "k8s",
            "wk",
        ]
        # (21 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
            # (7 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-550-disk-0" -> (known after apply)
            # (7 unchanged attributes hidden)
        }

      ~ initialization {
          - interface         = "ide2" -> null
          ~ user_data_file_id = "backup-nas:snippets/k3s-worker.cloud-config.yaml" # forces replacement -> (known after apply) # forces replacement
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ network_device {
          ~ mac_address = "E2:E1:41:CE:1C:11" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

Plan: 4 to add, 0 to change, 7 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/kubernetes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b498d417ac9c:4141/lock?id=resnostyle%252Fk8s-gitops%252Fterraform%252Fkubernetes%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/kubernetes`
</details>
Plan: 4 to add, 0 to change, 7 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`